{
  "content": [
    {
      "element": "blockquote",
      "attribution": "_why Why's (Poignant) Guide to Ruby",
      "content": [
        {
          "element": "p",
          "content": [
            "And my heart glows bright red under my filmy, translucent skin and they have to administer 10cc of JavaScript to get me to come back. (I respond well to toxins in the blood.) Man, that stuff will kick the peaches right out your gills!"
          ]
        }
      ]
    },
    {
      "element": "p",
      "content": [
        "In this chapter, we will start to do things that can actually be called ",
        {
          "element": "em",
          "content": [
            "programming"
          ]
        },
        ". We will expand our command of the JavaScript language beyond the nouns and sentence fragments we’ve seen so far, to the point where we can express some meaningful prose."
      ]
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "  In ",
            {
              "element": "reference",
              "content": "Chapter 1"
            },
            ", we made some values and then applied operators to them to get new values. Creating values like this is an essential part of every JavaScript program, but it is only a part."
          ]
        },
        {
          "element": "p",
          "content": [
            "A fragment of code that produces a value is called an ",
            {
              "element": "em",
              "content": [
                "expression"
              ]
            },
            ". Every value that is written literally (such as ",
            {
              "element": "literal",
              "content": [
                "22"
              ]
            },
            " or ",
            {
              "element": "literal",
              "content": [
                "\"psychoanalysis\""
              ]
            },
            ") is an expression. An expression between parentheses is also an expression, as is a binary operator applied to two expressions or a unary operator applied to one."
          ]
        },
        {
          "element": "p",
          "content": [
            " This shows part of the beauty of a language-based interface. Expressions can nest in a way very similar to the way subsentences in human languages are nested—a subsentence can contain its own subsentences, and so on. This allows us to combine expressions to express arbitrarily complex computations."
          ]
        },
        {
          "element": "p",
          "content": [
            "If an expression corresponds to a sentence fragment, a JavaScript ",
            {
              "element": "em",
              "content": [
                "statement"
              ]
            },
            " corresponds to a full sentence in a human language. A program is simply a list of statements."
          ]
        },
        {
          "element": "p",
          "content": [
            "The simplest kind of statement is an expression with a semicolon after it. This is a program:"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "It is a useless program, though. An expression can be content to just produce a value, which can then be used by the enclosing expression. A statement stands on its own and amounts to something only if it affects the world. It could display something on the screen—that counts as changing the world—or it could change the internal state of the machine in a way that will affect the statements that come after it. These changes are called ",
            {
              "element": "em",
              "content": [
                "side effects"
              ]
            },
            ". The statements in the previous example just produce the values ",
            {
              "element": "literal",
              "content": [
                "1"
              ]
            },
            " and ",
            {
              "element": "literal",
              "content": [
                "true"
              ]
            },
            " and then immediately throw them away. This leaves no impression on the world at all. When executing the program, nothing observable happens."
          ]
        },
        {
          "element": "p",
          "content": [
            "In some cases, JavaScript allows you to omit the semicolon at the end of a statement. In other cases, it has to be there, or the next line will be treated as part of the same statement. The rules for when it can be safely omitted are somewhat complex and error-prone. In this book, every statement that needs a semicolon will always be terminated by one. I recommend you do the same in your own programs, at least until you’ve learned more about subtleties involved in leaving out semicolons."
          ]
        }
      ],
      "title": "Expressions and statements"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            " How does a program keep an internal state? How does it remember things? We have seen how to produce new values from old values, but this does not change the old values, and the new value has to be immediately used or it will dissipate again. To catch and hold values, JavaScript provides a thing called a ",
            {
              "element": "em",
              "content": [
                "variable"
              ]
            },
            "."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "And that gives us our second kind of statement. The special word (",
            {
              "element": "em",
              "content": [
                "keyword"
              ]
            },
            ") ",
            {
              "element": "literal",
              "content": [
                "var"
              ]
            },
            " indicates that this sentence is going to define a variable. It is followed by the name of the variable and, if we want to immediately give it a value, by an ",
            {
              "element": "literal",
              "content": [
                "="
              ]
            },
            " operator and an expression."
          ]
        },
        {
          "element": "p",
          "content": [
            "The previous statement creates a variable called ",
            {
              "element": "literal",
              "content": [
                "caught"
              ]
            },
            " and uses it to grab hold of the number that is produced by multiplying 5 by 5."
          ]
        },
        {
          "element": "p",
          "content": [
            "After a variable has been defined, its name can be used as an expression. The value of such an expression is the value the variable currently holds. Here’s an example:"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            " Variable names can be any word that isn’t a reserved word (such as ",
            {
              "element": "literal",
              "content": [
                "var"
              ]
            },
            "). They may not include spaces. Digits can also be part of variable names—",
            {
              "element": "literal",
              "content": [
                "catch22"
              ]
            },
            " is a valid name, for example—but the name must not start with a digit. A variable name cannot include punctuation, except for the characters ",
            {
              "element": "literal",
              "content": [
                "$"
              ]
            },
            " and ",
            {
              "element": "literal",
              "content": [
                "_"
              ]
            },
            "."
          ]
        },
        {
          "element": "p",
          "content": [
            " When a variable points at a value, that does not mean it is tied to that value forever. The ",
            {
              "element": "literal",
              "content": [
                "="
              ]
            },
            " operator can be used at any time on existing variables to disconnect them from their current value and have them point to a new one."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            " You should imagine variables as tentacles, rather than boxes. They do not ",
            {
              "element": "em",
              "content": [
                "contain"
              ]
            },
            " values; they ",
            {
              "element": "em",
              "content": [
                "grasp"
              ]
            },
            " them—two variables can refer to the same value. A program can access only the values that it still has a hold on. When you need to remember something, you grow a tentacle to hold on to it or you reattach one of your existing tentacles to it."
          ]
        },
        {
          "element": "img",
          "src": "img/octopus.jpg"
        },
        {
          "element": "p",
          "content": [
            "Let’s look at an example. To remember the number of dollars that Luigi still owes you, you create a variable. And then when he pays back $35, you give this variable a new value."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "When you define a variable without giving it a value, the tentacle has nothing to grasp, so it ends in thin air. If you ask for the value of an empty variable, you’ll get the value ",
            {
              "element": "literal",
              "content": [
                "undefined"
              ]
            },
            "."
          ]
        },
        {
          "element": "p",
          "content": [
            "A single ",
            {
              "element": "literal",
              "content": [
                "var"
              ]
            },
            " statement may define multiple variables. The definitions must be separated by commas."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        }
      ],
      "title": "Variables"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            " Words with a special meaning, such as ",
            {
              "element": "literal",
              "content": [
                "var"
              ]
            },
            ", are ",
            {
              "element": "em",
              "content": [
                "keywords"
              ]
            },
            ", and they may not be used as variable names. There are also a number of words that are “reserved for use” in future versions of JavaScript. These are also officially not allowed to be used as variable names, though some JavaScript environments do allow them. The full list of keywords and reserved words is rather long."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "Don’t worry about memorizing these, but remember that this might be the problem when a variable definition does not work as expected."
          ]
        }
      ],
      "title": "Keywords and reserved words"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "The collection of variables and their values that exist at a given time is called the ",
            {
              "element": "em",
              "content": [
                "environment"
              ]
            },
            ". When a program starts up, this environment is not empty. It always contains variables that are part of the language standard, and most of the time, it has variables that provide ways to interact with the surrounding system. For example, in a browser, there are variables and functions to inspect and influence the currently loaded website and to read mouse and keyboard input."
          ]
        }
      ],
      "title": "The environment"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            " A lot of the values provided in the default environment have the type ",
            {
              "element": "em",
              "content": [
                "function"
              ]
            },
            ". A function is a piece of program wrapped in a value. Such values can be ",
            {
              "element": "em",
              "content": [
                "applied"
              ]
            },
            " in order to run the wrapped program. For example, in a browser environment, the variable ",
            {
              "element": "literal",
              "content": [
                "alert"
              ]
            },
            " holds a function that shows a little dialog box with a message. It is used like this:"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "img",
          "src": "img/alert.png"
        },
        {
          "element": "p",
          "content": [
            " Executing a function is called ",
            {
              "element": "em",
              "content": [
                "invoking"
              ]
            },
            ", ",
            {
              "element": "em",
              "content": [
                "calling"
              ]
            },
            ", or ",
            {
              "element": "em",
              "content": [
                "applying"
              ]
            },
            " it. You can call a function by putting parentheses after an expression that produces a function value. Usually you’ll directly use the name of the variable that holds the function. The values between the parentheses are given to the program inside the function. In the example, the ",
            {
              "element": "literal",
              "content": [
                "alert"
              ]
            },
            " function uses the string that we give it as the text to show in the dialog box. Values given to functions are called ",
            {
              "element": "em",
              "content": [
                "arguments"
              ]
            },
            ". The ",
            {
              "element": "literal",
              "content": [
                "alert"
              ]
            },
            " function needs only one of them, but other functions might need a different number or different types of arguments."
          ]
        }
      ],
      "title": "Functions"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "The ",
            {
              "element": "literal",
              "content": [
                "alert"
              ]
            },
            " function can be useful as an output device when experimenting, but clicking away all those little windows will get on your nerves. In past examples, we’ve used ",
            {
              "element": "literal",
              "content": [
                "console.log"
              ]
            },
            " to output values. Most JavaScript systems (including all modern web browsers and Node.js) provide a ",
            {
              "element": "literal",
              "content": [
                "console.log"
              ]
            },
            " function that writes out its arguments to ",
            {
              "element": "em",
              "content": [
                "some"
              ]
            },
            " text output device. In browsers, the output lands in the JavaScript console. This part of the browser interface is hidden by default, but most browsers open it when you press F12 or, on Mac, when you press Command-Option-I. If that does not work, search through the menus for an item named “web console” or “developer tools”."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "Though variable names cannot contain period characters, ",
            {
              "element": "literal",
              "content": [
                "console.log"
              ]
            },
            " clearly has one. This is because ",
            {
              "element": "literal",
              "content": [
                "console.log"
              ]
            },
            " isn’t a simple variable. It is actually an expression that retrieves the ",
            {
              "element": "literal",
              "content": [
                "log"
              ]
            },
            " property from the value held by the ",
            {
              "element": "literal",
              "content": [
                "console"
              ]
            },
            " variable. We will find out exactly what this means in ",
            {
              "element": "reference",
              "content": "Chapter 4"
            },
            "."
          ]
        }
      ],
      "title": "The console.log function"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            " Showing a dialog box or writing text to the screen is a ",
            {
              "element": "em",
              "content": [
                "side effect"
              ]
            },
            ". A lot of functions are useful because of the side effects they produce. Functions may also produce values, and in that case, they don’t need to have a side effect to be useful. For example, the function ",
            {
              "element": "literal",
              "content": [
                "Math.max"
              ]
            },
            " takes any number of number values and gives back the greatest."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            " When a function produces a value, it is said to ",
            {
              "element": "em",
              "content": [
                "return"
              ]
            },
            " that value. Anything that produces a value is an expression in JavaScript, which means function calls can be used within larger expressions. Here a call to ",
            {
              "element": "literal",
              "content": [
                "Math.min"
              ]
            },
            ", which is the opposite of ",
            {
              "element": "literal",
              "content": [
                "Math.max"
              ]
            },
            ", is used as an input to the plus operator:"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "The ",
            {
              "element": "reference",
              "content": "next chapter"
            },
            " explains how to write your own functions."
          ]
        }
      ],
      "title": "Return values"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "Browser environments contain other functions besides ",
            {
              "element": "literal",
              "content": [
                "alert"
              ]
            },
            " for popping up windows. You can ask the user an OK/Cancel question using ",
            {
              "element": "literal",
              "content": [
                "confirm"
              ]
            },
            ". This returns a Boolean: ",
            {
              "element": "literal",
              "content": [
                "true"
              ]
            },
            " if the user clicks OK and ",
            {
              "element": "literal",
              "content": [
                "false"
              ]
            },
            " if the user clicks Cancel."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "img",
          "src": "img/confirm.png"
        },
        {
          "element": "p",
          "content": [
            "The ",
            {
              "element": "literal",
              "content": [
                "prompt"
              ]
            },
            " function can be used to ask an “open” question. The first argument is the question, the second one is the text that the user starts with. A line of text can be typed into the dialog window, and the function will return this text as a string."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "img",
          "src": "img/prompt.png"
        },
        {
          "element": "p",
          "content": [
            "These two functions aren’t used much in modern web programming, mostly because you have no control over the way the resulting windows look, but they are useful for toy programs and experiments."
          ]
        }
      ],
      "title": "prompt and confirm"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "When your program contains more than one statement, the statements are executed, predictably, from top to bottom. As a basic example, this program has two statements. The first one asks the user for a number, and the second, which is executed afterward, shows the square of that number."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "  The function ",
            {
              "element": "literal",
              "content": [
                "Number"
              ]
            },
            " converts a value to a number. We need that conversion because the result of ",
            {
              "element": "literal",
              "content": [
                "prompt"
              ]
            },
            " is a string value, and we want a number. There are similar functions called ",
            {
              "element": "literal",
              "content": [
                "String"
              ]
            },
            " and ",
            {
              "element": "literal",
              "content": [
                "Boolean"
              ]
            },
            " that convert values to those types."
          ]
        },
        {
          "element": "p",
          "content": [
            "Here is the rather trivial schematic representation of straight control flow:"
          ]
        },
        {
          "element": "img",
          "src": "img/controlflow-straight.svg"
        }
      ],
      "title": "Control flow"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "Executing statements in straight-line order isn’t the only option we have. An alternative is ",
            {
              "element": "em",
              "content": [
                "conditional execution"
              ]
            },
            ", where we choose between two different routes based on a Boolean value, like this:"
          ]
        },
        {
          "element": "img",
          "src": "img/controlflow-if.svg"
        },
        {
          "element": "p",
          "content": [
            "Conditional execution is written with the ",
            {
              "element": "literal",
              "content": [
                "if"
              ]
            },
            " keyword in JavaScript. In the simple case, we just want some code to be executed if, and only if, a certain condition holds. For example, in the previous program, we might want to show the square of the input only if the input is actually a number."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "With this modification, if you enter “cheese”, no output will be shown."
          ]
        },
        {
          "element": "p",
          "content": [
            "The keyword ",
            {
              "element": "literal",
              "content": [
                "if"
              ]
            },
            " executes or skips a statement depending on the value of a Boolean expression. The deciding expression is written after the keyword, between parentheses, followed by the statement to execute."
          ]
        },
        {
          "element": "p",
          "content": [
            "The ",
            {
              "element": "literal",
              "content": [
                "isNaN"
              ]
            },
            " function is a standard JavaScript function that returns ",
            {
              "element": "literal",
              "content": [
                "true"
              ]
            },
            " only if the argument it is given is ",
            {
              "element": "literal",
              "content": [
                "NaN"
              ]
            },
            ". The ",
            {
              "element": "literal",
              "content": [
                "Number"
              ]
            },
            " function happens to return ",
            {
              "element": "literal",
              "content": [
                "NaN"
              ]
            },
            " when you give it a string that doesn’t represent a valid number. Thus, the condition translates to “unless ",
            {
              "element": "literal",
              "content": [
                "theNumber"
              ]
            },
            " is not-a-number, do this”."
          ]
        },
        {
          "element": "p",
          "content": [
            "You often won’t just have code that executes when a condition holds true, but also code that handles the other case. This alternate path is represented by the second arrow in the diagram. The ",
            {
              "element": "literal",
              "content": [
                "else"
              ]
            },
            " keyword can be used, together with ",
            {
              "element": "literal",
              "content": [
                "if"
              ]
            },
            ", to create two separate, alternative execution paths."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            " If we have more than two paths to choose from, multiple ",
            {
              "element": "literal",
              "content": [
                "if"
              ]
            },
            "/",
            {
              "element": "literal",
              "content": [
                "else"
              ]
            },
            " pairs can be “chained” together. Here’s an example:"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "The program will first check whether ",
            {
              "element": "literal",
              "content": [
                "num"
              ]
            },
            " is less than 10. If it is, it chooses that branch, shows ",
            {
              "element": "literal",
              "content": [
                "\"Small\""
              ]
            },
            ", and is done. If it isn’t, it takes the ",
            {
              "element": "literal",
              "content": [
                "else"
              ]
            },
            " branch, which itself contains a second ",
            {
              "element": "literal",
              "content": [
                "if"
              ]
            },
            ". If the second condition (",
            {
              "element": "literal",
              "content": [
                "<",
                " 100"
              ]
            },
            ") holds, that means the number is between 10 and 100, and ",
            {
              "element": "literal",
              "content": [
                "\"Medium\""
              ]
            },
            " is shown. If it doesn’t, the second, and last, ",
            {
              "element": "literal",
              "content": [
                "else"
              ]
            },
            " branch is chosen."
          ]
        },
        {
          "element": "p",
          "content": [
            "The flow chart for this program looks something like this:"
          ]
        },
        {
          "element": "img",
          "src": "img/controlflow-nested-if.svg"
        }
      ],
      "title": "Conditional execution"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "Consider a program that prints all even numbers from 0 to 12. One way to write this is as follows:"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "That works, but the idea of writing a program is to make something ",
            {
              "element": "em",
              "content": [
                "less"
              ]
            },
            " work, not more. If we needed all even numbers less than 1,000, the previous would be unworkable. What we need is a way to repeat some code. This form of control flow is called a ",
            {
              "element": "em",
              "content": [
                "loop"
              ]
            },
            ":"
          ]
        },
        {
          "element": "img",
          "src": "img/controlflow-loop.svg"
        },
        {
          "element": "p",
          "content": [
            "Looping control flow allows us to go back to some point in the program where we were before and repeat it with our current program state. If we combine this with a variable that counts, we can do something like this:"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "A statement starting with the keyword ",
            {
              "element": "literal",
              "content": [
                "while"
              ]
            },
            " creates a loop. The word ",
            {
              "element": "literal",
              "content": [
                "while"
              ]
            },
            " is followed by an expression in parentheses and then a statement, much like ",
            {
              "element": "literal",
              "content": [
                "if"
              ]
            },
            ". The loop executes that statement as long as the expression produces a value that is ",
            {
              "element": "literal",
              "content": [
                "true"
              ]
            },
            " when converted to Boolean type."
          ]
        },
        {
          "element": "p",
          "content": [
            "In this loop, we want to both print the current number and add two to our variable. Whenever we need to execute multiple statements inside a loop, we wrap them in curly braces (",
            {
              "element": "literal",
              "content": [
                "{"
              ]
            },
            " and ",
            {
              "element": "literal",
              "content": [
                "}"
              ]
            },
            "). Braces do for statements what parentheses do for expressions: they group them together, making them count as a single statement. A sequence of statements wrapped in braces is called a ",
            {
              "element": "em",
              "content": [
                "block"
              ]
            },
            "."
          ]
        },
        {
          "element": "p",
          "content": [
            "Many JavaScript programmers wrap every single loop or ",
            {
              "element": "literal",
              "content": [
                "if"
              ]
            },
            " body in braces. They do this both for the sake of consistency and to avoid having to add or remove braces when changing the number of statements in the body later. In this book, I will write most single-statement bodies without braces, since I value brevity. You are free to go with whichever style you prefer."
          ]
        },
        {
          "element": "p",
          "content": [
            "The variable ",
            {
              "element": "literal",
              "content": [
                "number"
              ]
            },
            " demonstrates the way a variable can track the progress of a program. Every time the loop repeats, ",
            {
              "element": "literal",
              "content": [
                "number"
              ]
            },
            " is incremented by ",
            {
              "element": "literal",
              "content": [
                "2"
              ]
            },
            ". Then, at the beginning of every repetition, it is compared with the number ",
            {
              "element": "literal",
              "content": [
                "12"
              ]
            },
            " to decide whether the program has done all the work it intended to do."
          ]
        },
        {
          "element": "p",
          "content": [
            "As an example that actually does something useful, we can now write a program that calculates and shows the value of 2",
            {
              "element": "superscript",
              "content": [
                "10"
              ]
            },
            " (2 to the 10th power). We use two variables: one to keep track of our result and one to count how often we have multiplied this result by 2. The loop tests whether the second variable has reached 10 yet and then updates both variables."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "The counter could also start at ",
            {
              "element": "literal",
              "content": [
                "1"
              ]
            },
            " and check for ",
            {
              "element": "literal",
              "content": [
                "<",
                "= 10"
              ]
            },
            ", but, for reasons that will become apparent in ",
            {
              "element": "reference",
              "content": "Chapter 4"
            },
            ", it is a good idea to get used to counting from 0."
          ]
        },
        {
          "element": "p",
          "content": [
            "The ",
            {
              "element": "literal",
              "content": [
                "do"
              ]
            },
            " loop is a control structure similar to the ",
            {
              "element": "literal",
              "content": [
                "while"
              ]
            },
            " loop. It differs only on one point: a ",
            {
              "element": "literal",
              "content": [
                "do"
              ]
            },
            " loop always executes its body at least once, and it starts testing whether it should stop only after that first execution. To reflect this, the test appears after the body of the loop:"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            " This program will force you to enter a name. It will ask again and again until it gets something that is not an empty string. Applying the ",
            {
              "element": "literal",
              "content": [
                "!"
              ]
            },
            " operator will convert a value to Boolean type before negating it, and all strings except ",
            {
              "element": "literal",
              "content": [
                "\"\""
              ]
            },
            " convert to ",
            {
              "element": "literal",
              "content": [
                "true"
              ]
            },
            ". This means the loop continues going round until you provide a name that is not the empty string."
          ]
        }
      ],
      "title": "while and do loops"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "You’ve probably noticed the spaces I put in front of some statements. In JavaScript, these are not required—the computer will accept the program just fine without them. In fact, even the line breaks in programs are optional. You could write a program as a single long line if you felt like it. The role of the indentation inside blocks is to make the structure of the code stand out. In complex code, where new blocks are opened inside other blocks, it can become hard to see where one block ends and another begins. With proper indentation, the visual shape of a program corresponds to the shape of the blocks inside it. I like to use two spaces for every open block, but tastes differ—some people use four spaces, and some people use tab characters."
          ]
        }
      ],
      "title": "Indenting Code"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "Many loops follow the pattern seen in the previous ",
            {
              "element": "literal",
              "content": [
                "while"
              ]
            },
            " examples. First, a “counter” variable is created to track the progress of the loop. Then comes a ",
            {
              "element": "literal",
              "content": [
                "while"
              ]
            },
            " loop, whose test expression usually checks whether the counter has reached some boundary yet. At the end of the loop body, the counter is updated to track progress."
          ]
        },
        {
          "element": "p",
          "content": [
            "Because this pattern is so common, JavaScript and similar languages provide a slightly shorter and more comprehensive form, the ",
            {
              "element": "literal",
              "content": [
                "for"
              ]
            },
            " loop."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "This program is exactly equivalent to the ",
            {
              "element": "reference",
              "content": "earlier"
            },
            " even-number-printing example. The only change is that all the statements that are related to the “state” of the loop are now grouped together."
          ]
        },
        {
          "element": "p",
          "content": [
            "The parentheses after a ",
            {
              "element": "literal",
              "content": [
                "for"
              ]
            },
            " keyword must contain two semicolons. The part before the first semicolon ",
            {
              "element": "em",
              "content": [
                "initializes"
              ]
            },
            " the loop, usually by defining a variable. The second part is the expression that ",
            {
              "element": "em",
              "content": [
                "checks"
              ]
            },
            " whether the loop must continue. The final part ",
            {
              "element": "em",
              "content": [
                "updates"
              ]
            },
            " the state of the loop after every iteration. In most cases, this is shorter and clearer than a ",
            {
              "element": "literal",
              "content": [
                "while"
              ]
            },
            " construct."
          ]
        },
        {
          "element": "p",
          "content": [
            "Here is the code that computes 2",
            {
              "element": "superscript",
              "content": [
                "10"
              ]
            },
            ", using ",
            {
              "element": "literal",
              "content": [
                "for"
              ]
            },
            " instead of ",
            {
              "element": "literal",
              "content": [
                "while"
              ]
            },
            ":"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "Note that even though no block is opened with a ",
            {
              "element": "literal",
              "content": [
                "{"
              ]
            },
            ", the statement in the loop is still indented two spaces to make it clear that it “belongs” to the line before it."
          ]
        }
      ],
      "title": "for loops"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            " Having the loop’s condition produce ",
            {
              "element": "literal",
              "content": [
                "false"
              ]
            },
            " is not the only way a loop can finish. There is a special statement called ",
            {
              "element": "literal",
              "content": [
                "break"
              ]
            },
            " that has the effect of immediately jumping out of the enclosing loop."
          ]
        },
        {
          "element": "p",
          "content": [
            "This program illustrates the ",
            {
              "element": "literal",
              "content": [
                "break"
              ]
            },
            " statement. It finds the first number that is both greater than or equal to 20 and divisible by 7."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "Using the remainder (",
            {
              "element": "literal",
              "content": [
                "%"
              ]
            },
            ") operator is an easy way to test whether a number is divisible by another number. If it is, the remainder of their division is zero."
          ]
        },
        {
          "element": "p",
          "content": [
            "The ",
            {
              "element": "literal",
              "content": [
                "for"
              ]
            },
            " construct in the example does not have a part that checks for the end of the loop. This means that the loop will never stop unless the ",
            {
              "element": "literal",
              "content": [
                "break"
              ]
            },
            " statement inside is executed."
          ]
        },
        {
          "element": "p",
          "content": [
            "If you were to leave out that ",
            {
              "element": "literal",
              "content": [
                "break"
              ]
            },
            " statement or accidentally write a condition that always produces ",
            {
              "element": "literal",
              "content": [
                "true"
              ]
            },
            ", your program would get stuck in an ",
            {
              "element": "em",
              "content": [
                "infinite loop"
              ]
            },
            ". A program stuck in an infinite loop will never finish running, which is usually a bad thing."
          ]
        },
        {
          "element": "p",
          "content": [
            "The ",
            {
              "element": "literal",
              "content": [
                "continue"
              ]
            },
            " keyword is similar to ",
            {
              "element": "literal",
              "content": [
                "break"
              ]
            },
            ", in that it influences the progress of a loop. When ",
            {
              "element": "literal",
              "content": [
                "continue"
              ]
            },
            " is encountered in a loop body, control jumps out of the body and continues with the loop’s next iteration."
          ]
        }
      ],
      "title": "Breaking Out of a Loop"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "Especially when looping, a program often needs to “update” a variable to hold a value based on that variable’s previous value."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "JavaScript provides a shortcut for this:"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "Similar shortcuts work for many other operators, such as ",
            {
              "element": "literal",
              "content": [
                "result *= 2"
              ]
            },
            " to double ",
            {
              "element": "literal",
              "content": [
                "result"
              ]
            },
            " or ",
            {
              "element": "literal",
              "content": [
                "counter -= 1"
              ]
            },
            " to count downward."
          ]
        },
        {
          "element": "p",
          "content": [
            "This allows us to shorten our counting example a little more."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "For ",
            {
              "element": "literal",
              "content": [
                "counter += 1"
              ]
            },
            " and ",
            {
              "element": "literal",
              "content": [
                "counter -=",
                " ",
                "1"
              ]
            },
            ", there are even shorter equivalents: ",
            {
              "element": "literal",
              "content": [
                "counter++"
              ]
            },
            " and ",
            {
              "element": "literal",
              "content": [
                "counter--"
              ]
            },
            "."
          ]
        }
      ],
      "title": "Updating variables succinctly"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            " It is common for code to look like this:"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "There is a construct called ",
            {
              "element": "literal",
              "content": [
                "switch"
              ]
            },
            " that is intended to solve such a “dispatch” in a more direct way. Unfortunately, the syntax JavaScript uses for this (which it inherited from the C/Java line of programming languages) is somewhat awkward—a chain of ",
            {
              "element": "literal",
              "content": [
                "if"
              ]
            },
            " statements often looks better. Here is an example:"
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "You may put any number of ",
            {
              "element": "literal",
              "content": [
                "case"
              ]
            },
            " labels inside the block opened by ",
            {
              "element": "literal",
              "content": [
                "switch"
              ]
            },
            ". The program will jump to the label that corresponds to the value that ",
            {
              "element": "literal",
              "content": [
                "switch"
              ]
            },
            " was given or to ",
            {
              "element": "literal",
              "content": [
                "default"
              ]
            },
            " if no matching value is found. It starts executing statements there, even if they’re under another label, until it reaches a ",
            {
              "element": "literal",
              "content": [
                "break"
              ]
            },
            " statement. In some cases, such as the ",
            {
              "element": "literal",
              "content": [
                "\"sunny\""
              ]
            },
            " case in the example, this can be used to share some code between cases (it recommends going outside for both sunny and cloudy weather). But beware: it is easy to forget such a ",
            {
              "element": "literal",
              "content": [
                "break"
              ]
            },
            ", which will cause the program to execute code you do not want executed."
          ]
        }
      ],
      "title": "Dispatching on a value with switch"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            " Variable names may not contain spaces, yet it is often helpful to use multiple words to clearly describe what the variable represents. These are pretty much your choices for writing a variable name with several words in it:"
          ]
        },
        {
          "element": "pre",
          "content": "fuzzylittleturtle\nfuzzy_little_turtle\nFuzzyLittleTurtle\nfuzzyLittleTurtle"
        },
        {
          "element": "p",
          "content": [
            "The first style can be hard to read. Personally, I like the look of the underscores, though that style is a little painful to type. The standard JavaScript functions, and most JavaScript programmers, follow the bottom style—they capitalize every word except the first. It is not hard to get used to little things like that, and code with mixed naming styles can be jarring to read, so we will just follow this convention."
          ]
        },
        {
          "element": "p",
          "content": [
            "In a few cases, such as the ",
            {
              "element": "literal",
              "content": [
                "Number"
              ]
            },
            " function, the first letter of a variable is also capitalized. This was done to mark this function as a constructor. What a constructor is will become clear in ",
            {
              "element": "reference",
              "content": "Chapter 6"
            },
            ". For now, the important thing is not to be bothered by this apparent lack of consistency."
          ]
        }
      ],
      "title": "Capitalization"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "Often, raw code does not convey all the information you want a program to convey to human readers, or it conveys it in such a cryptic way that people might not understand it. At other times, you might just feel poetic or want to include some thoughts as part of your program. This is what ",
            {
              "element": "em",
              "content": [
                "comments"
              ]
            },
            " are for."
          ]
        },
        {
          "element": "p",
          "content": [
            "A comment is a piece of text that is part of a program but is completely ignored by the computer. JavaScript has two ways of writing comments. To write a single-line comment, you can use two slash characters (",
            {
              "element": "literal",
              "content": [
                "//"
              ]
            },
            ") and then the comment text after it."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        },
        {
          "element": "p",
          "content": [
            "A ",
            {
              "element": "literal",
              "content": [
                "//"
              ]
            },
            " comment goes only to the end of the line. A section of text between ",
            {
              "element": "literal",
              "content": [
                "/*"
              ]
            },
            " and ",
            {
              "element": "literal",
              "content": [
                "*/"
              ]
            },
            " will be ignored, regardless of whether it contains line breaks. This is often useful for adding blocks of information about a file or a chunk of program."
          ]
        },
        {
          "element": "listing",
          "numbered": false,
          "content": []
        }
      ],
      "title": "Comments"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "You now know that a program is built out of statements, which themselves sometimes contain more statements. Statements tend to contain expressions, which themselves can be built out of smaller expressions."
          ]
        },
        {
          "element": "p",
          "content": [
            "Putting statements after one another gives you a program that is executed from top to bottom. You can introduce disturbances in the flow of control by using conditional (",
            {
              "element": "literal",
              "content": [
                "if"
              ]
            },
            ", ",
            {
              "element": "literal",
              "content": [
                "else"
              ]
            },
            ", and ",
            {
              "element": "literal",
              "content": [
                "switch"
              ]
            },
            ") and looping (",
            {
              "element": "literal",
              "content": [
                "while"
              ]
            },
            ", ",
            {
              "element": "literal",
              "content": [
                "do"
              ]
            },
            ", and ",
            {
              "element": "literal",
              "content": [
                "for"
              ]
            },
            ") statements."
          ]
        },
        {
          "element": "p",
          "content": [
            "Variables can be used to file pieces of data under a name, and they are useful for tracking state in your program. The environment is the set of variables that are defined. JavaScript systems always put a number of useful standard variables into your environment."
          ]
        },
        {
          "element": "p",
          "content": [
            "Functions are special values that encapsulate a piece of program. You can invoke them by writing ",
            {
              "element": "literal",
              "content": [
                "functionName(argument1, argument2)"
              ]
            },
            ". Such a function call is an expression, and may produce a value."
          ]
        }
      ],
      "title": "Summary"
    },
    {
      "element": "section",
      "content": [
        {
          "element": "p",
          "content": [
            "If you are unsure how to try your solutions to exercises, refer to the ",
            {
              "element": "reference",
              "content": "introduction"
            },
            "."
          ]
        },
        {
          "element": "p",
          "content": [
            "Each exercise starts with a problem description. Read that and try to solve the exercise. If you run into problems, consider reading the hints after the exercise. Full solutions to the exercises are not included in this book, but you can find them online at ",
            {
              "element": "reference",
              "content": [
                {
                  "element": "em",
                  "content": [
                    "eloquentjavascript.net/code"
                  ]
                }
              ]
            },
            ". If you want to learn something from the exercises, I recommend looking at the solutions only after you’ve solved the exercise, or at least after you’ve attacked it long and hard enough to have a slight headache."
          ]
        },
        {
          "element": "section",
          "content": [
            {
              "element": "p",
              "content": [
                "Write a loop that makes seven calls to ",
                {
                  "element": "literal",
                  "content": [
                    "console.log"
                  ]
                },
                " to output the following triangle:"
              ]
            },
            {
              "element": "pre",
              "content": "#\n##\n###\n####\n#####\n######\n#######"
            },
            {
              "element": "p",
              "content": [
                "It may be useful to know that you can find the length of a string by writing ",
                {
                  "element": "literal",
                  "content": [
                    ".length"
                  ]
                },
                " after it."
              ]
            },
            {
              "element": "listing",
              "numbered": false,
              "content": []
            },
            {
              "element": "p",
              "content": [
                "You can start with a program that simply prints out the numbers 1 to 7, which you can derive by making a few modifications to the ",
                {
                  "element": "reference",
                  "content": "even number printing example"
                },
                " given earlier in the chapter, where the ",
                {
                  "element": "literal",
                  "content": [
                    "for"
                  ]
                },
                " loop was introduced."
              ]
            },
            {
              "element": "p",
              "content": [
                "Now consider the equivalence between numbers and strings of hash characters. You can go from 1 to 2 by adding 1 (",
                {
                  "element": "literal",
                  "content": [
                    "+= 1"
                  ]
                },
                "). You can go from ",
                {
                  "element": "literal",
                  "content": [
                    "\"#\""
                  ]
                },
                " to ",
                {
                  "element": "literal",
                  "content": [
                    "\"##\""
                  ]
                },
                " by adding a character (",
                {
                  "element": "literal",
                  "content": [
                    "+= \"#\""
                  ]
                },
                "). Thus, your solution can closely follow the number-printing program."
              ]
            }
          ],
          "title": "Looping a triangle"
        },
        {
          "element": "section",
          "content": [
            {
              "element": "p",
              "content": [
                "Write a program that uses ",
                {
                  "element": "literal",
                  "content": [
                    "console.log"
                  ]
                },
                " to print all the numbers from 1 to 100, with two exceptions. For numbers divisible by 3, print ",
                {
                  "element": "literal",
                  "content": [
                    "\"Fizz\""
                  ]
                },
                " instead of the number, and for numbers divisible by 5 (and not 3), print ",
                {
                  "element": "literal",
                  "content": [
                    "\"Buzz\""
                  ]
                },
                " instead."
              ]
            },
            {
              "element": "p",
              "content": [
                "When you have that working, modify your program to print ",
                {
                  "element": "literal",
                  "content": [
                    "\"FizzBuzz\""
                  ]
                },
                ", for numbers that are divisible by both 3 and 5 (and still print ",
                {
                  "element": "literal",
                  "content": [
                    "\"Fizz\""
                  ]
                },
                " or ",
                {
                  "element": "literal",
                  "content": [
                    "\"Buzz\""
                  ]
                },
                " for numbers divisible by only one of those)."
              ]
            },
            {
              "element": "p",
              "content": [
                "(This is actually an interview question that has been claimed to weed out a significant percentage of programmer candidates. So if you solved it, you’re now allowed to feel good about yourself.)"
              ]
            },
            {
              "element": "p",
              "content": [
                "Going over the numbers is clearly a looping job, and selecting what to print is a matter of conditional execution. Remember the trick of using the remainder (",
                {
                  "element": "literal",
                  "content": [
                    "%"
                  ]
                },
                ") operator for checking whether a number is divisible by another number (has a remainder of zero)."
              ]
            },
            {
              "element": "p",
              "content": [
                "In the first version, there are three possible outcomes for every number, so you’ll have to create an ",
                {
                  "element": "literal",
                  "content": [
                    "if"
                  ]
                },
                "/",
                {
                  "element": "literal",
                  "content": [
                    "else if"
                  ]
                },
                "/",
                {
                  "element": "literal",
                  "content": [
                    "else"
                  ]
                },
                " chain."
              ]
            },
            {
              "element": "p",
              "content": [
                " The second version of the program has a straightforward solution and a clever one. The simple way is to add another “branch” to precisely test the given condition. For the clever method, build up a string containing the word or words to output, and print either this word or the number if there is no word, potentially by making elegant use of the ",
                {
                  "element": "literal",
                  "content": [
                    "||"
                  ]
                },
                " operator."
              ]
            }
          ],
          "title": "FizzBuzz"
        },
        {
          "element": "section",
          "content": [
            {
              "element": "p",
              "content": [
                " Write a program that creates a string that represents an 8×8 grid, using newline characters to separate lines. At each position of the grid there is either a space or a “#” character. The characters should form a chess board."
              ]
            },
            {
              "element": "p",
              "content": [
                "Passing this string to ",
                {
                  "element": "literal",
                  "content": [
                    "console.log"
                  ]
                },
                " should show something like this:"
              ]
            },
            {
              "element": "pre",
              "content": " # # # #\n# # # #\n # # # #\n# # # #\n # # # #\n# # # #\n # # # #\n# # # #"
            },
            {
              "element": "p",
              "content": [
                "When you have a program that generates this pattern, define a variable ",
                {
                  "element": "literal",
                  "content": [
                    "size = 8"
                  ]
                },
                " and change the program so that it works for any ",
                {
                  "element": "literal",
                  "content": [
                    "size"
                  ]
                },
                ", outputting a grid of the given width and height."
              ]
            },
            {
              "element": "p",
              "content": [
                "The string can be built by starting with an empty one (",
                {
                  "element": "literal",
                  "content": [
                    "\"\""
                  ]
                },
                ") and repeatedly adding characters. A newline character is written ",
                {
                  "element": "literal",
                  "content": [
                    "\"\\n\""
                  ]
                },
                "."
              ]
            },
            {
              "element": "p",
              "content": [
                "Use ",
                {
                  "element": "literal",
                  "content": [
                    "console.log"
                  ]
                },
                " to inspect the output of your program."
              ]
            },
            {
              "element": "p",
              "content": [
                " To work with two dimensions, you will need a loop inside of a loop. Put curly braces around the bodies of both loops to make it easy to see where they start and end. Try to properly indent these bodies. The order of the loops must follow the order in which we build up the string (line by line, left to right, top to bottom). So the outer loop handles the lines and the inner loop handles the characters on a line."
              ]
            },
            {
              "element": "p",
              "content": [
                "You’ll need two variables to track your progress. To know whether to put a space or a hash sign at a given position, you could test whether the sum of the two counters is even (",
                {
                  "element": "literal",
                  "content": [
                    "% 2"
                  ]
                },
                ")."
              ]
            },
            {
              "element": "p",
              "content": [
                "Terminating a line by adding a newline character happens after the line has been built up, so do this after the inner loop but inside of the outer loop."
              ]
            }
          ],
          "title": "Chess board"
        }
      ],
      "title": "Exercises"
    }
  ],
  "title": "Program Structure"
}
